---
title: BoundingBoxXYZ
classe: Autodesk.Revit.DB.BoundingBoxXYZ
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# BoundingBoxXYZ

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean BoundEnabled { get; set; }` | `boundingBoxXYZ.BoundEnabled` | Boolean |
| `XYZ Bounds { get; set; }` | `boundingBoxXYZ.Bounds` | XYZ |
| `Boolean Enabled { get; set; }` | `boundingBoxXYZ.Enabled` | Boolean |
| `Boolean IsSet { get; }` | `boundingBoxXYZ.IsSet` | Boolean |
| `XYZ Max { get; set; }` | `boundingBoxXYZ.Max` | XYZ |
| `Boolean MaxEnabled { get; set; }` | `boundingBoxXYZ.MaxEnabled` | Boolean |
| `XYZ Min { get; set; }` | `boundingBoxXYZ.Min` | XYZ |
| `Boolean MinEnabled { get; set; }` | `boundingBoxXYZ.MinEnabled` | Boolean |
| `Transform Transform { get; set; }` | `boundingBoxXYZ.Transform` | Transform |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```